PunchThrough/bean-arduino-core/hardware/bean/boards.txt
lightblue-bean.name=LightBlue Bean
lightblue-bean.upload.protocol= ptdble
lightblue-bean.upload.maximum_size=32256
lightblue-bean.upload.speed=57600
lightblue-bean.build.mcu=atmega328p
lightblue-bean.build.f_cpu=8000000L
lightblue-bean.build.core=bean
lightblue-bean.build.variant=bean
lightblue-bean.build.post_compile_script=Bean-Loader-Mac.app/Contents/Resources/post_compile


##############################################################

proBean.name=Arduino Pro Like A Bean

proBean.upload.protocol=arduino
proBean.upload.maximum_size=30720
proBean.upload.speed=57600

proBean.bootloader.low_fuses=0xFF
proBean.bootloader.high_fuses=0xDA
proBean.bootloader.extended_fuses=0x05
proBean.bootloader.path=atmega
proBean.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
proBean.bootloader.unlock_bits=0x3F
proBean.bootloader.lock_bits=0x0F

proBean.build.mcu=atmega328p
proBean.build.f_cpu=8000000L
proBean.build.core=bean
proBean.build.variant=standard

##############################################################

lightblue-ftdi-bean.name=Bean Pin Mapping With FTDI Programmer

lightblue-ftdi-bean.upload.protocol=arduino
lightblue-ftdi-bean.upload.maximum_size=30720
lightblue-ftdi-bean.upload.speed=57600

lightblue-ftdi-bean.bootloader.low_fuses=0xFF
lightblue-ftdi-bean.bootloader.high_fuses=0xDA
lightblue-ftdi-bean.bootloader.extended_fuses=0x05
lightblue-ftdi-bean.bootloader.path=atmega
lightblue-ftdi-bean.bootloader.file=ATmegaBOOT_168_atmega328_pro_8MHz.hex
lightblue-ftdi-bean.bootloader.unlock_bits=0x3F
lightblue-ftdi-bean.bootloader.lock_bits=0x0F

lightblue-ftdi-bean.build.mcu=atmega328p
lightblue-ftdi-bean.build.f_cpu=8000000L
lightblue-ftdi-bean.build.core=bean
lightblue-ftdi-bean.build.variant=bean